---
kind: property
id: P:Autodesk.Revit.DB.ViewCropRegionShapeManager.CanBeSplit
source: html/1fc2640b-6c4a-2d85-39a7-2b50f3377145.htm
---
# Autodesk.Revit.DB.ViewCropRegionShapeManager.CanBeSplit Property

Verifies that the crop of the associated view is permitted to have multiple regions.

## Syntax (C#)
```csharp
public bool CanBeSplit { get; }
```